Revit 2027 API
FilteredElementCollector.ToElements Method
 Returns the complete set of elements that pass the filter(s).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Element> ToElements()
Public Function ToElements As IList(Of Element)
public:
IList<Element^>^ ToElements()
member ToElements : unit -> IList<Element>
Return Value
IList<Element>
 The complete set of element ids.
Exceptions
Exception | Condition
InvalidOperationException |  The collector does not have a filter applied. Extraction or iteration of elements is not permitted without a filter.
Remarks
 This will reset the collector to the beginning and extract all elements that pass the applied filter(s). If you have an active iterator to this same collector it will be stopped by this call.
See Also
Reference
FilteredElementCollector Class
Autodesk.Revit.DB Namespace